'''Сложность: О(n)
Алгоритм принимает число
Если число чётное делит его на 2
Если нечётное вычитает из него единицу
Считает количество итераций'''



def even(num):
    steps = 0  #Вводим переменную - счетчик
    while num > 0:  #Ограничиваем работу алгоритма
        if num % 2 != 0: #Проверяем четность числа
            num -= 1 #Вычитаем единицу, если число не четное
        else:
            num /= 2 #Деление четного числа на 2
        steps += 1 #  Добавляем единицу к количество итераций
    return steps #Возвращаем количество итераций


print(even(30)) #Вызывыем алгоритм